[
  {
    "id": "1",
    "title": "Deployment service",
    "category": "Technology",
    "client": "TechCorp Solutions",
    "services": ["Cloud Infrastructure", "DevOps", "Automation"],
    "shortDescription": "Servicio automatizado de despliegue en la nube con integración continua.",
    "longDescription": "Desarrollamos una plataforma completa de despliegue automatizado que permite a los equipos de desarrollo implementar sus aplicaciones de manera rápida y segura. La solución incluye pipelines de CI/CD, monitoreo en tiempo real, y rollback automático en caso de errores. Utilizamos tecnologías como Docker, Kubernetes, y AWS para garantizar escalabilidad y alta disponibilidad.",
    "results": "Reducción del 75% en tiempo de despliegue, 99.9% de uptime, y eliminación completa de errores manuales en producción.",
    "image": "/src/assets/images/projects/section1-imagen1.webp",
    "similar": ["2", "3", "5"]
  },
  {
    "id": "2",
    "title": "Tech solution",
    "category": "Development",
    "client": "InnovateX",
    "services": ["Full-Stack Development", "API Design", "Database Architecture"],
    "shortDescription": "Solución tecnológica integral para optimización de procesos empresariales.",
    "longDescription": "Creamos una solución tecnológica completa que integra múltiples sistemas empresariales en una plataforma unificada. El proyecto incluyó el desarrollo de APIs RESTful, una interfaz de usuario moderna con React, y una arquitectura de microservicios robusta. La solución permite a las empresas gestionar sus operaciones de manera más eficiente y tomar decisiones basadas en datos en tiempo real.",
    "results": "Incremento del 40% en productividad, reducción del 60% en tiempo de procesamiento de datos, y mejora significativa en la experiencia del usuario.",
    "image": "/src/assets/images/projects/section1-imagen2.webp",
    "similar": ["1", "4", "6"]
  },
  {
    "id": "3",
    "title": "Platform integration",
    "category": "Solution",
    "client": "GlobalTech Inc",
    "services": ["System Integration", "API Development", "Data Migration"],
    "shortDescription": "Integración completa de múltiples plataformas empresariales.",
    "longDescription": "Lideramos un proyecto complejo de integración que conectó más de 15 sistemas diferentes en una sola plataforma cohesiva. El desafío principal fue mantener la integridad de los datos mientras se migraban terabytes de información histórica. Implementamos una arquitectura de eventos que permite la sincronización en tiempo real entre todos los sistemas, garantizando consistencia y disponibilidad.",
    "results": "Unificación exitosa de 15 sistemas, reducción del 80% en inconsistencias de datos, y ahorro anual de $2M en costos operativos.",
    "image": "/src/assets/images/projects/section1-imagen3.webp",
    "similar": ["1", "2", "4"]
  },
  {
    "id": "4",
    "title": "Cyber security",
    "category": "Design",
    "client": "SecureNet Corp",
    "services": ["Security Audit", "Penetration Testing", "Security Architecture"],
    "shortDescription": "Sistema integral de ciberseguridad con monitoreo 24/7.",
    "longDescription": "Diseñamos e implementamos una solución de ciberseguridad de nivel empresarial que protege activos digitales críticos. El sistema incluye detección de amenazas en tiempo real, análisis de comportamiento basado en IA, y respuesta automática a incidentes. Además, desarrollamos un centro de operaciones de seguridad (SOC) que proporciona monitoreo continuo y análisis forense avanzado.",
    "results": "Reducción del 95% en incidentes de seguridad, detección de amenazas en menos de 30 segundos, y cumplimiento total con estándares ISO 27001.",
    "image": "/src/assets/images/projects/section1-imagen4.webp",
    "similar": ["2", "3", "6"]
  },
  {
    "id": "5",
    "title": "Mobile application",
    "category": "Technology",
    "client": "MobileFirst Solutions",
    "services": ["Mobile Development", "UX/UI Design", "Backend API"],
    "shortDescription": "Aplicación móvil nativa con funcionalidades avanzadas de geolocalización.",
    "longDescription": "Desarrollamos una aplicación móvil multiplataforma que revoluciona la forma en que los usuarios interactúan con servicios de ubicación. La app incluye navegación en tiempo real, realidad aumentada, y funcionalidades sociales que permiten compartir experiencias. Utilizamos React Native para garantizar un rendimiento nativo en iOS y Android, con un backend robusto en Node.js y MongoDB.",
    "results": "Más de 500K descargas en los primeros 6 meses, calificación de 4.8 estrellas en app stores, y 85% de retención de usuarios activos.",
    "image": "/src/assets/images/projects/section1-imagen5.webp",
    "similar": ["1", "3", "6"]
  },
  {
    "id": "6",
    "title": "Creative ideas",
    "category": "Ideas",
    "client": "Creative Studios",
    "services": ["Creative Direction", "Digital Strategy", "Brand Development"],
    "shortDescription": "Plataforma digital innovadora para gestión de ideas creativas.",
    "longDescription": "Creamos una plataforma digital que transforma la manera en que los equipos creativos colaboran y desarrollan ideas. La solución incluye herramientas de brainstorming virtual, gestión de proyectos creativos, y un sistema de feedback en tiempo real. La plataforma utiliza inteligencia artificial para sugerir conexiones entre ideas y optimizar el proceso creativo, resultando en una experiencia única para profesionales creativos.",
    "results": "Incremento del 60% en la velocidad de desarrollo de ideas, mejora del 45% en la colaboración entre equipos, y reducción del 30% en tiempo de iteración.",
    "image": "/src/assets/images/projects/section1-imagen6.webp",
    "similar": ["2", "4", "5"]
  }
]